app/controllers/tasks_controller.rb

SELECT "tasks".* FROM "tasks" WHERE "tasks"."id" = ? LIMIT ?  [["id", nil], ["LIMIT", 1]]
---
    def show
        begin
          @task = Task.find(params[:id])

INSERT INTO "tasks" ("name", "description", "due_date", "status", "priority", "user_id", "category_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?)
---
        task = Task.new(task_params)
        if task.save

UPDATE "tasks" SET "name" = ?, "updated_at" = ? WHERE "tasks"."id" = ?  [["name", "New Task Name"], ["updated_at", "2023-03-29 09:54:28.822053"], ["id", 1]]
SELECT "tasks".* FROM "tasks" WHERE "tasks"."user_id" = ? AND "tasks"."id" = ? LIMIT ?  [["user_id", 62], ["id", nil], ["LIMIT", 1]]
---
        task = user.tasks.find(params[:id]).update(task_params)