app/controllers/users_controller.rb

  def create
    user = User.create(user_params)
---
INSERT INTO "users" ("username", "email", "password_digest", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["username", "alvin"], ["email", "alvin@example.com"], ["password_digest", "[FILTERED]"], ["created_at", "2023-03-30 13:22:26.871911"], ["updated_at", "2023-03-30 13:22:26.871911"]]